In [242]:
from sklearn.linear_model import LinearRegression
import numpy as np
from matplotlib import pyplot as plt
import pandas as pd

In [243]:
# Load the data

In [244]:
bli = pd.read_csv(r"C:\Users\175045\Amit Python\O'Reilly Book\BLI.csv")
weo = pd.read_csv(r"C:\Users\175045\Amit Python\O'Reilly Book\WEO_Data.xls.csv")

In [245]:
bli.columns

Index(['LOCATION', 'Country', 'INDICATOR', 'Indicator', 'MEASURE', 'Measure',
       'INEQUALITY', 'Inequality', 'Unit Code', 'Unit', 'PowerCode Code',
       'PowerCode', 'Reference Period Code', 'Reference Period', 'Value',
       'Flag Codes', 'Flags'],
      dtype='object')

In [246]:
bli = bli.drop(columns = ['LOCATION', 'INDICATOR', 'Indicator', 'MEASURE', 'Measure','INEQUALITY', 'Inequality', 'Unit Code', 'Unit', 'PowerCode Code',
       'PowerCode', 'Reference Period Code', 'Reference Period'])

In [247]:
bli = bli.drop(columns='Flag Codes')

In [248]:
bli = bli.drop(columns='Flags')

In [249]:
bli.shape

(2369, 2)

In [250]:
weo.shape

(191, 7)

In [251]:
weo.columns

Index(['Country', 'Subject Descriptor', 'Units', 'Scale',
       'Country/Series-specific Notes', '2015', 'Estimates Start After'],
      dtype='object')

In [252]:
weo = weo.drop(columns=['Subject Descriptor', 'Units', 'Scale','Country/Series-specific Notes', 'Estimates Start After'])

In [253]:
weo

                                               Country       2015
0                                          Afghanistan    599.994
1                                              Albania   3,995.38
2                                              Algeria   4,318.14
3                                               Angola   4,100.32
4                                  Antigua and Barbuda  14,414.30
..                                                 ...        ...
186                                              Yemen   1,302.94
187                                             Zambia   1,350.15
188                                           Zimbabwe   1,064.35
189                                                NaN        NaN
190  International Monetary Fund, World Economic Ou...        NaN

[191 rows x 2 columns]

In [254]:
weo = weo.dropna()

In [255]:
weo.shape

(187, 2)

In [256]:
bli

             Country  Value
0          Australia   5.40
1            Austria   3.50
2            Belgium   3.70
3             Canada   6.00
4     Czech Republic   3.10
...              ...    ...
2364       Lithuania   0.54
2365        Colombia  32.09
2366       Lithuania   0.67
2367        Colombia  19.37
2368       Lithuania   0.43

[2369 rows x 2 columns]

In [257]:
weo.shape

(187, 2)

In [258]:
bli.shape

(2369, 2)

In [ ]:
# Merge the table

In [259]:
mergerofdata = pd.merge(weo,bli, how="inner")

In [260]:
mergerofdata

            Country       2015  Value
0         Australia  50,961.87   5.40
1         Australia  50,961.87   5.90
2         Australia  50,961.87   5.00
3         Australia  50,961.87   2.29
4         Australia  50,961.87  11.02
...             ...        ...    ...
2300  United States  55,805.20  15.21
2301  United States  55,805.20   6.67
2302  United States  55,805.20  14.44
2303  United States  55,805.20  14.48
2304  United States  55,805.20  14.40

[2305 rows x 3 columns]

In [261]:
mergerofdata.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2305 entries, 0 to 2304
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  2305 non-null   object
 1   2015     2305 non-null   object
 2   Value    2305 non-null   float64
dtypes: float64(1), object(2)
memory usage: 72.0+ KB

In [262]:
final_data = mergerofdata.drop_duplicates(subset="Country") # remove the duplicate as per one column

In [263]:
final_data.shape

(40, 3)

In [264]:
final_data.head()

       Country       2015  Value
0    Australia  50,961.87    5.4
59     Austria  43,724.03    3.5
121    Belgium  40,106.63    3.7
183     Brazil   8,670.00    2.2
223     Canada  43,331.96    6.0

In [265]:
lr = LinearRegression()

In [266]:
x = final_data.iloc[:,1:2] # Selct feature for X

In [267]:
y = final_data.iloc[:,2:] # Selct feature for Y

In [268]:
y = y.astype(float) # Convert the values to float

In [269]:
x["2015"] = x["2015"].str.replace(",","").astype(float) # Replace the unwanted element(",") and convert it into float

In [276]:
x = x.reset_index(drop=True) # Remove index
y = y.reset_index(drop=True)

In [277]:
from sklearn.model_selection import train_test_split

In [278]:
x_train, x_test, y_train, y_test = train_test_split(x,y, test_size=0.2)

In [279]:
lr.fit(x_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [280]:
predict = lr.predict(x_test)

In [281]:
y_test, predict

(    Value
 35    3.2
 11    7.6
 23    1.7
 12    2.7
 6     1.4
 27    2.2
 1     3.5
 24    5.5,
 array([[ 4.62430786],
        [ 6.72466598],
        [-4.35647753],
        [ 6.15242492],
        [12.16737357],
        [ 0.32481782],
        [ 5.68251707],
        [11.66331043]]))